package $Expertise.DataStructures.implemented.Problems;

import java.util.Set;

//Find the three index elements that result as the given sum; i!=j!=k
public class ThreeSum {
    public static void main(String[] args) {
        String str= "ൽഹിയിൽ പിച്ചിചീന്തപ്പെട്ട നിർഭയ എന്ന പെൺകുട്ടിയുടെ സഹോദ ആ സത്യം പറയുന്നു എന്ന് പറഞ്ഞത്\u200C നിർഭയയുടെ മാതാവാണ്\u200C..!\n" +
                "സൈന്യത്തിൽ പൈലറ്റ് ആവണമെന്ന് ചെറുപ്പം മുതലേ ആഗ്രഹിച്ചിരുന്ന അവന്റെ സ്വപ്നങ്ങൾക്ക് ചേച്ചിയുടെ മരണം വലിയൊരു ആഘാതമായിരുന്നു ഉണ്ടാക്കിയിരുന്നത്. തുടർന്ന് അവനെ രാഹുൽഗാന്ധി ഏറ്റെടുക്കുകയായിരുന്നു. സോണിയാ ഗാന്ധിയുടെ മണ്ഡലമായ റായ്ബറേലിയയിലെ ഇന്ദിരാ ഗാന്ധി രാഷ്ട്രീയ ഉഡാൻ അക്കാദമി എന്ന സ്ഥാപനത്തിൽ പൈലറ്റ് പരിശീലനത്തിന് രാഹുൽ ഗാന്ധി സൗകര്യമൊരുക്കുകയും പ്രത്യേക കൗൺസിലിങ് ഏർപ്പെടുത്തിക്കൊടുക്കുകയും ചെയ്തു..!\n" +
                "പഠനത്തിന്റെ പൂർണ ചെലവും രാഹുൽ ഗാന്ധിയുടെ വകയായിരുന്നു. മകൻ പൈലറ്റായി കാണുന്നതിൽ ഏറെ സന്തോഷമുണ്ടെന്ന് നിർഭയയുടെ അമ്മ ആശാ ദേവി പറഞ്ഞു. രാഹുൽ ഗാന്ധിക്കും പ്രിയങ്ക ഗാന്ധിക്കും പ്രത്യേക നന്ദിയെന്നും അവർ അറിയിച്ചു. അവൻ പൈലറ്റായി കാണണമെഗാന്ധി..!";

        for (int i = 0; i <str.length() ; i++) {
            System.out.println((int)'ഡ');
        }
    }
}
